; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; DOMAIN: Project_TER (Forklift-Based Warehouse System)
;;
;; Purpose:
;; This domain models a warehouse system where a worker uses a forklift
;; (fenwick) to transport and process packages through a structured pipeline.
;;
;; Key features:
;;   - Forklift-based movement (mounted worker system)
;;   - Package scanning for traceability
;;   - Mixed packages contain two items
;;   - Mono Packages contain one item
;;   - Mixed package sorting into new pallets
;;   - Multi-step processing workflow
;;   - Cost-based optimization
;;
;; Workflow:
;;   Arrival → Sorting → Storage → Preparation → Control → Shipping
;;
;; Important rule:
;;   Mixed packages must be unpacked and redistributed into new pallets
;;   before they can follow the normal workflow.
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain Project_TER)

    (:requirements
        :strips
        :typing
        :action-costs
        :disjunctive-preconditions
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; TYPES
    ;;
    ;; loc:
    ;;     Warehouse locations (zones and docks)
    ;;
    ;; worker:
    ;;     Human operator controlling forklift operations
    ;;
    ;; fenwick:
    ;;     Forklift vehicle used for transportation
    ;;
    ;; package:
    ;;     Physical goods moving through the warehouse
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:types
        loc worker fenwick package
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; PREDICATES
    ;;
    ;; POSITIONING
    ;;
    ;; (at ?obj ?l)
    ;;     Object (worker, forklift, or package) is at location
    ;;
    ;; (connected ?l1 ?l2)
    ;;     Two locations are directly connected
    ;;
    ;;
    ;; FORKLIFT STATE
    ;;
    ;; (worker_mounted ?w ?v)
    ;;     Worker is operating a forklift
    ;;
    ;; (carrying ?v ?p)
    ;;     Forklift is carrying a package
    ;;
    ;; (forklift_empty ?v)
    ;;     Forklift is not carrying anything
    ;;
    ;;
    ;; PACKAGE TYPE
    ;;
    ;; (is_mono ?p)
    ;;     Package is a standard single unit
    ;;
    ;; (is_mixed ?p)
    ;;     Package contains multiple items
    ;;
    ;; (contains ?p ?item)
    ;;     Package contains an item
    ;;
    ;; (empty ?p)
    ;;     Package is empty (used for building new pallets)
    ;;
    ;;
    ;; TRACEABILITY & STATUS
    ;;
    ;; (product_scanned ?p)
    ;;     Package has been scanned
    ;;
    ;; (prepared ?p)
    ;;     Package is ready for inspection
    ;;
    ;; (controlled ?p)
    ;;     Package passed quality control
    ;;
    ;; (loaded ?p)
    ;;     Package has been shipped
    ;;
    ;;
    ;; ZONES
    ;;
    ;; (is_truck ?l)
    ;; (is_arrival_zone ?l)
    ;; (is_prep_zone ?l)
    ;; (is_control_zone ?l)
    ;; (is_shipping_dock ?l)
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:predicates
        (at ?obj - object ?l - loc)
        (connected ?l1 - loc ?l2 - loc)

        (worker_mounted ?w - worker ?v - fenwick)
        (carrying ?v - fenwick ?p - package)
        (forklift_empty ?v - fenwick)

        (is_mono ?p - package)
        (is_mixed ?p - package)
        (contains ?p - package ?item - object)
        (empty ?p - package)

        (product_scanned ?p - package)
        (prepared ?p - package)
        (controlled ?p - package)
        (loaded ?p - package)

        (is_truck ?l - loc)
        (is_arrival_zone ?l - loc)
        (is_prep_zone ?l - loc)
        (is_control_zone ?l - loc)
        (is_shipping_dock ?l - loc)
    )

    (:functions
        (total-cost)
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: mount_fenwick
    ;;
    ;; Purpose:
    ;;     Worker mounts the forklift to begin vehicle operations.
    ;;
    ;; Preconditions:
    ;;     - Worker and forklift are at same location
    ;;
    ;; Effects:
    ;;     - Worker becomes mounted on forklift
    ;;     - Cost increases
    ;;
    ;; Workflow Stage:
    ;;     Vehicle activation
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action mount_fenwick
        :parameters (?w - worker ?v - fenwick ?l - loc)
        :precondition (and (at ?w ?l) (at ?v ?l))
        :effect (and
            (not (at ?w ?l))
            (worker_mounted ?w ?v)
            (increase (total-cost) 5)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: dismount_fenwick
    ;;
    ;; Purpose:
    ;;     Worker leaves the forklift.
    ;;
    ;; Preconditions:
    ;;     - Worker is mounted on forklift
    ;;     - Forklift is at a location
    ;;
    ;; Effects:
    ;;     - Worker returns to ground movement
    ;;     - Cost increases
    ;;
    ;; Workflow Stage:
    ;;     Vehicle deactivation
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action dismount_fenwick
        :parameters (?w - worker ?v - fenwick ?l - loc)
        :precondition (and (worker_mounted ?w ?v) (at ?v ?l))
        :effect (and
            (at ?w ?l)
            (not (worker_mounted ?w ?v))
            (increase (total-cost) 5)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: drive_fenwick
    ;;
    ;; Purpose:
    ;;     Move forklift between connected warehouse locations.
    ;;
    ;; Preconditions:
    ;;     - Worker is mounted on forklift
    ;;     - Forklift is at starting location
    ;;     - Locations are connected
    ;;
    ;; Effects:
    ;;     - Forklift moves to new location
    ;;     - Cost increases
    ;;
    ;; Workflow Stage:
    ;;     Transport
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action drive_fenwick
        :parameters (?w - worker ?v - fenwick ?from - loc ?to - loc)
        :precondition (and
            (worker_mounted ?w ?v)
            (at ?v ?from)
            (connected ?from ?to)
        )
        :effect (and
            (not (at ?v ?from))
            (at ?v ?to)
            (increase (total-cost) 20)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: load_forklift
    ;;
    ;; Purpose:
    ;;     Load a package onto the forklift.
    ;;
    ;; Preconditions:
    ;;     - Worker is mounted
    ;;     - Package is at same location
    ;;     - Forklift is empty
    ;;
    ;; Effects:
    ;;     - Package is loaded onto forklift
    ;;     - Forklift becomes occupied
    ;;
    ;; Workflow Stage:
    ;;     Loading
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action load_forklift
        :parameters (?w - worker ?v - fenwick ?p - package ?l - loc)
        :precondition (and
            (worker_mounted ?w ?v)
            (at ?v ?l)
            (at ?p ?l)
            (forklift_empty ?v)
        )
        :effect (and
            (not (at ?p ?l))
            (carrying ?v ?p)
            (not (forklift_empty ?v))
            (increase (total-cost) 5)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: unload_forklift
    ;;
    ;; Purpose:
    ;;     Remove a package from forklift at destination.
    ;;
    ;; Preconditions:
    ;;     - Worker is mounted
    ;;     - Forklift is carrying a package
    ;;
    ;; Effects:
    ;;     - Package is placed at location
    ;;     - Forklift becomes empty
    ;;
    ;; Workflow Stage:
    ;;     Unloading
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action unload_forklift
        :parameters (?w - worker ?v - fenwick ?p - package ?l - loc)
        :precondition (and
            (worker_mounted ?w ?v)
            (at ?v ?l)
            (carrying ?v ?p)
        )
        :effect (and
            (at ?p ?l)
            (not (carrying ?v ?p))
            (forklift_empty ?v)
            (increase (total-cost) 5)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: scan_product
    ;;
    ;; Purpose:
    ;;     Record a traceability scan for a package.
    ;;
    ;; Preconditions:
    ;;     - Package is at location
    ;;     - Worker or forklift is present
    ;;
    ;; Effects:
    ;;     - Package is marked as scanned
    ;;
    ;; Workflow Stage:
    ;;     Traceability
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action scan_product
        :parameters (?w - worker ?p - package ?l - loc)
        :precondition (and
            (at ?p ?l)
            (or
                (at ?w ?l)
                (exists (?v - fenwick)
                    (and (worker_mounted ?w ?v) (at ?v ?l))
                )
            )
        )
        :effect (and
            (product_scanned ?p)
            (increase (total-cost) 1)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: sort_into_new_palette
    ;;
    ;; Purpose:
    ;;     Convert mixed package contents into new mono/standard pallets.
    ;;
    ;; Preconditions:
    ;;     - Mixed package is at arrival zone
    ;;     - Target pallet is empty
    ;;
    ;; Effects:
    ;;     - Item is removed from mixed package
    ;;     - New pallet is created/filled
    ;;
    ;; Workflow Stage:
    ;;     Sorting / decomposition
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action sort_into_new_palette
        :parameters (?w - worker ?mixed_pal - package ?item - object ?target_pal - package ?l - loc)
        :precondition (and
            (at ?w ?l)
            (at ?mixed_pal ?l)
            (at ?target_pal ?l)
            (is_mixed ?mixed_pal)
            (contains ?mixed_pal ?item)
            (empty ?target_pal)
            (is_arrival_zone ?l)
        )
        :effect (and
            (not (contains ?mixed_pal ?item))
            (not (empty ?target_pal))
            (is_mono ?target_pal)
            (increase (total-cost) 15)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: mark_prepared
    ;;
    ;; Purpose:
    ;;     Mark package as ready for inspection.
    ;;
    ;; Preconditions:
    ;;     - Package is mono type
    ;;     - Package is at prep zone
    ;;     - Package has been scanned
    ;;
    ;; Effects:
    ;;     - Package becomes prepared
    ;;
    ;; Workflow Stage:
    ;;     Preparation
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action mark_prepared
        :parameters (?w - worker ?p - package ?l - loc)
        :precondition (and
            (at ?p ?l)
            (product_scanned ?p)
            (is_mono ?p)
            (is_prep_zone ?l)
            (or
                (at ?w ?l)
                (exists (?v - fenwick)
                    (and (worker_mounted ?w ?v) (at ?v ?l))
                )
            )
        )
        :effect (and
            (prepared ?p)
            (increase (total-cost) 2)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: mark_controlled
    ;;
    ;; Purpose:
    ;;     Quality inspection approval step.
    ;;
    ;; Preconditions:
    ;;     - Package is prepared
    ;;     - Package is at control zone
    ;;
    ;; Effects:
    ;;     - Package is marked as controlled
    ;;
    ;; Workflow Stage:
    ;;     Quality control
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action mark_controlled
        :parameters (?w - worker ?p - package ?l - loc)
        :precondition (and
            (at ?p ?l)
            (prepared ?p)
            (is_control_zone ?l)
            (or
                (at ?w ?l)
                (exists (?v - fenwick)
                    (and (worker_mounted ?w ?v) (at ?v ?l))
                )
            )
        )
        :effect (and
            (controlled ?p)
            (increase (total-cost) 2)
        )
    )

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ACTION: mark_loaded
    ;;
    ;; Purpose:
    ;;     Final shipping step for a package.
    ;;
    ;; Preconditions:
    ;;     - Package is controlled
    ;;     - Package is at shipping dock
    ;;
    ;; Effects:
    ;;     - Package is marked as loaded (shipped)
    ;;
    ;; Workflow Stage:
    ;;     Final delivery
    ;;
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (:action mark_loaded
        :parameters (?w - worker ?p - package ?l - loc)
        :precondition (and
            (at ?p ?l)
            (controlled ?p)
            (is_shipping_dock ?l)
            (or
                (at ?w ?l)
                (exists (?v - fenwick)
                    (and (worker_mounted ?w ?v) (at ?v ?l))
                )
            )
        )
        :effect (and
            (loaded ?p)
            (increase (total-cost) 2)
        )
    )
)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; PROBLEM: Basic warehouse test
;;
;; Purpose:
;; This scenario models a full warehouse processing pipeline with:
;;   - Standard mono packages
;;   - Mixed packages that must be split into multiple products
;;   - Target pallets used to receive sorted items
;;
;; Key workflow:
;;   Arrival → Sorting → Processing → Control → Shipping
;;
;; Core rules:
;;   - Mixed packages must be decomposed into individual items
;;   - Items must be placed into target pallets
;;   - Every package must pass scanning before shipping
;;
;; Optimization goal:
;;   Minimize total operational cost
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem WAREHOUSE_TEST_BASIC)

(:domain Project_TER)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; OBJECTS
;;
;; LOCATIONS:
;;   loc_truck     : Incoming delivery truck area
;;   loc_arrival   : Receiving / unloading zone
;;   loc_prep      : Preparation area
;;   loc_control   : Quality control zone
;;   loc_shipping  : Final shipping dock
;;
;; WORKER:
;;   cariste1      : Warehouse operator
;;
;; VEHICLE:
;;   fenwick1      : Forklift vehicle used for transport
;;
;; PACKAGES:
;;   pal_mono      : Standard incoming package
;;   pal_mixed     : Mixed package requiring splitting
;;
;; TARGET PALLETS:
;;   pal_target1   : Empty pallet to receive sorted product
;;   pal_target2   : Empty pallet to receive sorted product
;;
;; MIXED CONTENT ITEMS:
;;   item_batch_a  : Item inside mixed package
;;   item_batch_b  : Item inside mixed package
;;
;; STANDARD OBJECT:
;;   mono_product  : Single product contained in pal_mono
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:objects
    ;; Locations
    loc_truck loc_arrival loc_prep loc_control loc_shipping - loc

    ;; Worker and forklift
    cariste1 - worker
    fenwick1 - fenwick

    ;; Incoming packages
    pal_mono - package
    pal_mixed - package

    ;; Empty target pallets (for sorting output)
    pal_target1 - package
    pal_target2 - package

    ;; Mixed package contents
    item_batch_a item_batch_b - object

    ;; Mono product content
    mono_product - object
)

(:init

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; INITIAL CONDITIONS
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (is_mono pal_mono)
    (is_mixed pal_mixed)

    (forklift_empty fenwick1)

    (= (total-cost) 0)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; INITIAL POSITIONS
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (at cariste1 loc_truck)
    (at fenwick1 loc_truck)

    (at pal_mono loc_truck)
    (at pal_mixed loc_truck)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; PACKAGE CONTENT STRUCTURE
    ;;
    ;; Mono package contains a single product
    ;; Mixed package contains multiple items that must be split
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (contains pal_mono mono_product)

    (contains pal_mixed item_batch_a)
    (contains pal_mixed item_batch_b)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; TARGET PALLETS (EMPTY STORAGE UNITS)
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (at pal_target1 loc_arrival)
    (at pal_target2 loc_arrival)

    (empty pal_target1)
    (empty pal_target2)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; WAREHOUSE TOPOLOGY
    ;;
    ;; Bidirectional connections between all zones
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (connected loc_truck loc_arrival)
    (connected loc_arrival loc_truck)

    (connected loc_arrival loc_prep)
    (connected loc_prep loc_arrival)

    (connected loc_prep loc_control)
    (connected loc_control loc_prep)

    (connected loc_control loc_shipping)
    (connected loc_shipping loc_control)

    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
    ;; ZONE DEFINITIONS
    ;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

    (is_truck loc_truck)
    (is_arrival_zone loc_arrival)
    (is_prep_zone loc_prep)
    (is_control_zone loc_control)
    (is_shipping_dock loc_shipping)
)

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;; GOAL STATE
;;
;; The scenario is complete when:
;;   - Mono package is successfully shipped
;;   - Target pallets are loaded with processed items
;;   - All packages have passed scanning validation
;;
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:goal (and

    ;; Main delivery requirement
    (loaded pal_mono)

    ;; Sorted outputs must be shipped
    (loaded pal_target1)
    (loaded pal_target2)

    ;; Traceability requirement (all items must be scanned)
    (product_scanned pal_mono)
    (product_scanned pal_target1)
    (product_scanned pal_target2)
))

(:metric minimize (total-cost))

)

; plan
1. (scan_product cariste1 pal_mono loc_truck)
   added: (product_scanned pal_mono)
   goals met: 1 of 6
2. (mount_fenwick cariste1 fenwick1 loc_truck)
   deleted: (at cariste1 loc_truck)
   added: (worker_mounted cariste1 fenwick1)
   goals met: 1 of 6
3. (load_forklift cariste1 fenwick1 pal_mixed loc_truck)
   deleted: (at pal_mixed loc_truck) (forklift_empty fenwick1)
   added: (carrying fenwick1 pal_mixed)
   goals met: 1 of 6
4. (drive_fenwick cariste1 fenwick1 loc_truck loc_arrival)
   deleted: (at fenwick1 loc_truck)
   added: (at fenwick1 loc_arrival)
   goals met: 1 of 6
5. (unload_forklift cariste1 fenwick1 pal_mixed loc_arrival)
   deleted: (carrying fenwick1 pal_mixed)
   added: (at pal_mixed loc_arrival) (forklift_empty fenwick1)
   goals met: 1 of 6
6. (dismount_fenwick cariste1 fenwick1 loc_arrival)
   deleted: (worker_mounted cariste1 fenwick1)
   added: (at cariste1 loc_arrival)
   goals met: 1 of 6
7. (sort_into_new_palette cariste1 pal_mixed item_batch_a pal_target1 loc_arrival)
   deleted: (contains pal_mixed item_batch_a) (empty pal_target1)
   added: (is_mono pal_target1)
   goals met: 1 of 6
8. (scan_product cariste1 pal_target1 loc_arrival)
   added: (product_scanned pal_target1)
   goals met: 2 of 6
9. (scan_product cariste1 pal_target2 loc_arrival)
   added: (product_scanned pal_target2)
   goals met: 3 of 6
10. (sort_into_new_palette cariste1 pal_mixed item_batch_b pal_target2 loc_arrival)
   deleted: (contains pal_mixed item_batch_b) (empty pal_target2)
   added: (is_mono pal_target2)
   goals met: 3 of 6
11. (mount_fenwick cariste1 fenwick1 loc_arrival)
   deleted: (at cariste1 loc_arrival)
   added: (worker_mounted cariste1 fenwick1)
   goals met: 3 of 6
12. (load_forklift cariste1 fenwick1 pal_target2 loc_arrival)
   deleted: (at pal_target2 loc_arrival) (forklift_empty fenwick1)
   added: (carrying fenwick1 pal_target2)
   goals met: 3 of 6
13. (drive_fenwick cariste1 fenwick1 loc_arrival loc_prep)
   deleted: (at fenwick1 loc_arrival)
   added: (at fenwick1 loc_prep)
   goals met: 3 of 6
14. (unload_forklift cariste1 fenwick1 pal_target2 loc_prep)
   deleted: (carrying fenwick1 pal_target2)
   added: (at pal_target2 loc_prep) (forklift_empty fenwick1)
   goals met: 3 of 6
15. (mark_prepared cariste1 pal_target2 loc_prep)
   added: (prepared pal_target2)
   goals met: 3 of 6
16. (load_forklift cariste1 fenwick1 pal_target2 loc_prep)
   deleted: (at pal_target2 loc_prep) (forklift_empty fenwick1)
   added: (carrying fenwick1 pal_target2)
   goals met: 3 of 6
17. (drive_fenwick cariste1 fenwick1 loc_prep loc_control)
   deleted: (at fenwick1 loc_prep)
   added: (at fenwick1 loc_control)
   goals met: 3 of 6
18. (unload_forklift cariste1 fenwick1 pal_target2 loc_control)
   deleted: (carrying fenwick1 pal_target2)
   added: (at pal_target2 loc_control) (forklift_empty fenwick1)
   goals met: 3 of 6
19. (mark_controlled cariste1 pal_target2 loc_control)
   added: (controlled pal_target2)
   goals met: 3 of 6
20. (load_forklift cariste1 fenwick1 pal_target2 loc_control)
   deleted: (at pal_target2 loc_control) (forklift_empty fenwick1)
   added: (carrying fenwick1 pal_target2)
   goals met: 3 of 6
21. (drive_fenwick cariste1 fenwick1 loc_control loc_shipping)
   deleted: (at fenwick1 loc_control)
   added: (at fenwick1 loc_shipping)
   goals met: 3 of 6
22. (unload_forklift cariste1 fenwick1 pal_target2 loc_shipping)
   deleted: (carrying fenwick1 pal_target2)
   added: (at pal_target2 loc_shipping) (forklift_empty fenwick1)
   goals met: 3 of 6
23. (mark_loaded cariste1 pal_target2 loc_shipping)
   added: (loaded pal_target2)
   goals met: 4 of 6
24. (drive_fenwick cariste1 fenwick1 loc_shipping loc_control)
   deleted: (at fenwick1 loc_shipping)
   added: (at fenwick1 loc_control)
   goals met: 4 of 6
25. (drive_fenwick cariste1 fenwick1 loc_control loc_prep)
   deleted: (at fenwick1 loc_control)
   added: (at fenwick1 loc_prep)
   goals met: 4 of 6
26. (drive_fenwick cariste1 fenwick1 loc_prep loc_arrival)
   deleted: (at fenwick1 loc_prep)
   added: (at fenwick1 loc_arrival)
   goals met: 4 of 6
27. (drive_fenwick cariste1 fenwick1 loc_arrival loc_truck)
   deleted: (at fenwick1 loc_arrival)
   added: (at fenwick1 loc_truck)
   goals met: 4 of 6
28. (load_forklift cariste1 fenwick1 pal_mono loc_truck)
   deleted: (at pal_mono loc_truck) (forklift_empty fenwick1)
   added: (carrying fenwick1 pal_mono)
   goals met: 4 of 6
29. (drive_fenwick cariste1 fenwick1 loc_truck loc_arrival)
   deleted: (at fenwick1 loc_truck)
   added: (at fenwick1 loc_arrival)
   goals met: 4 of 6
30. (drive_fenwick cariste1 fenwick1 loc_arrival loc_prep)
   deleted: (at fenwick1 loc_arrival)
   added: (at fenwick1 loc_prep)
   goals met: 4 of 6
31. (unload_forklift cariste1 fenwick1 pal_mono loc_prep)
   deleted: (carrying fenwick1 pal_mono)
   added: (at pal_mono loc_prep) (forklift_empty fenwick1)
   goals met: 4 of 6
32. (mark_prepared cariste1 pal_mono loc_prep)
   added: (prepared pal_mono)
   goals met: 4 of 6
33. (load_forklift cariste1 fenwick1 pal_mono loc_prep)
   deleted: (at pal_mono loc_prep) (forklift_empty fenwick1)
   added: (carrying fenwick1 pal_mono)
   goals met: 4 of 6
34. (drive_fenwick cariste1 fenwick1 loc_prep loc_control)
   deleted: (at fenwick1 loc_prep)
   added: (at fenwick1 loc_control)
   goals met: 4 of 6
35. (unload_forklift cariste1 fenwick1 pal_mono loc_control)
   deleted: (carrying fenwick1 pal_mono)
   added: (at pal_mono loc_control) (forklift_empty fenwick1)
   goals met: 4 of 6
36. (mark_controlled cariste1 pal_mono loc_control)
   added: (controlled pal_mono)
   goals met: 4 of 6
37. (load_forklift cariste1 fenwick1 pal_mono loc_control)
   deleted: (at pal_mono loc_control) (forklift_empty fenwick1)
   added: (carrying fenwick1 pal_mono)
   goals met: 4 of 6
38. (drive_fenwick cariste1 fenwick1 loc_control loc_shipping)
   deleted: (at fenwick1 loc_control)
   added: (at fenwick1 loc_shipping)
   goals met: 4 of 6
39. (unload_forklift cariste1 fenwick1 pal_mono loc_shipping)
   deleted: (carrying fenwick1 pal_mono)
   added: (at pal_mono loc_shipping) (forklift_empty fenwick1)
   goals met: 4 of 6
40. (mark_loaded cariste1 pal_mono loc_shipping)
   added: (loaded pal_mono)
   goals met: 5 of 6
41. (drive_fenwick cariste1 fenwick1 loc_shipping loc_control)
   deleted: (at fenwick1 loc_shipping)
   added: (at fenwick1 loc_control)
   goals met: 5 of 6
42. (drive_fenwick cariste1 fenwick1 loc_control loc_prep)
   deleted: (at fenwick1 loc_control)
   added: (at fenwick1 loc_prep)
   goals met: 5 of 6
43. (drive_fenwick cariste1 fenwick1 loc_prep loc_arrival)
   deleted: (at fenwick1 loc_prep)
   added: (at fenwick1 loc_arrival)
   goals met: 5 of 6
44. (load_forklift cariste1 fenwick1 pal_target1 loc_arrival)
   deleted: (at pal_target1 loc_arrival) (forklift_empty fenwick1)
   added: (carrying fenwick1 pal_target1)
   goals met: 5 of 6
45. (drive_fenwick cariste1 fenwick1 loc_arrival loc_prep)
   deleted: (at fenwick1 loc_arrival)
   added: (at fenwick1 loc_prep)
   goals met: 5 of 6
46. (unload_forklift cariste1 fenwick1 pal_target1 loc_prep)
   deleted: (carrying fenwick1 pal_target1)
   added: (at pal_target1 loc_prep) (forklift_empty fenwick1)
   goals met: 5 of 6
47. (mark_prepared cariste1 pal_target1 loc_prep)
   added: (prepared pal_target1)
   goals met: 5 of 6
48. (load_forklift cariste1 fenwick1 pal_target1 loc_prep)
   deleted: (at pal_target1 loc_prep) (forklift_empty fenwick1)
   added: (carrying fenwick1 pal_target1)
   goals met: 5 of 6
49. (drive_fenwick cariste1 fenwick1 loc_prep loc_control)
   deleted: (at fenwick1 loc_prep)
   added: (at fenwick1 loc_control)
   goals met: 5 of 6
50. (unload_forklift cariste1 fenwick1 pal_target1 loc_control)
   deleted: (carrying fenwick1 pal_target1)
   added: (at pal_target1 loc_control) (forklift_empty fenwick1)
   goals met: 5 of 6
51. (mark_controlled cariste1 pal_target1 loc_control)
   added: (controlled pal_target1)
   goals met: 5 of 6
52. (load_forklift cariste1 fenwick1 pal_target1 loc_control)
   deleted: (at pal_target1 loc_control) (forklift_empty fenwick1)
   added: (carrying fenwick1 pal_target1)
   goals met: 5 of 6
53. (drive_fenwick cariste1 fenwick1 loc_control loc_shipping)
   deleted: (at fenwick1 loc_control)
   added: (at fenwick1 loc_shipping)
   goals met: 5 of 6
54. (unload_forklift cariste1 fenwick1 pal_target1 loc_shipping)
   deleted: (carrying fenwick1 pal_target1)
   added: (at pal_target1 loc_shipping) (forklift_empty fenwick1)
   goals met: 5 of 6
55. (mark_loaded cariste1 pal_target1 loc_shipping)
   added: (loaded pal_target1)
   goals met: 6 of 6
